
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГУИД = Параметры.ГУИД;
	
	ПолучитьИнициативу();
КонецПроцедуры


&НаСервере
Процедура ПолучитьИнициативу ()
	
	
	Файлы.Очистить();
	
	Логин = Константы.Логин.Получить();
	СерверИсточник = "mysony";
	Адрес = "/backend/hs/v1/initiative/"+ Логин + "/" + ГУИД;
	
	HTTPЗапрос = Новый HTTPЗапрос(Адрес);
		
	HTTP = Новый HTTPСоединение(СерверИсточник);
	HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Чтение		 =	Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаОтвета);
	Джисон = ПрочитатьJSON(Чтение,Истина);
	Если ТипЗнч(Джисон) = Тип("Соответствие") Тогда
		Инициатива = Джисон["Наименование"];
		Лайки = Джисон["ОценкаЛайк"];
		СрокОбсуждения = Джисон["СрокДо"];
		Содержание = Джисон["Содержание"];
		ПользовательПрошелОпрос = Джисон["ПользовательПрошелОпрос"];
		КоличествоОтзывов = Джисон["КоличествоОтзывов"];
		МассивФайлов = Джисон["МассивФайлов"];	
	КонецЕсли;
	
	ЭтаФорма.Заголовок = Инициатива;
	
	Для сч = 0 по МассивФайлов.Количество()-1 Цикл
		Файлы.Добавить();
		Файлы[сч].ИмяФайла =МассивФайлов[сч]["ИмяФайла"];
		Файлы[сч].Файл = Base64Значение(МассивФайлов[сч]["Файл"]);
	КонецЦикла;
	
	Если ПользовательПрошелОпрос Тогда
		Элементы.ПройтиОпрос.Видимость = Ложь;
	Иначе
		Элементы.ПройтиОпрос.Видимость = Истина;
	КонецЕсли;
	
		
				
КОнецпроцедуры


&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ВыбраннаяСтрока > Файлы.Количество()-1 Тогда 
		ВыбраннаяСтрока = 0;
	КонецЕсли;
	Файл = Новый Файл(Файлы[ВыбраннаяСтрока].ИмяФайла);
	ИмяФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);
	ДвоичныеДанные = Файлы[ВыбраннаяСтрока].Файл;
	ДвоичныеДанные.Записать(ИмяФайла);
	
	
//	Данные=ДвоичныеДанные.Получить();
//ИмяФайла=ПолучитьИмяВременногоФайла(".doc");
//Данные.Записать(ИмяФайла);
//	
	//ДвоичныеДанные.Записать(ИмяФайла);                                                                +
	//ПолучитьФайл(ДвоичныеДанные, ИмяФайла, Ложь);
	ЗапуститьПриложение(ИмяФайла);

КонецПроцедуры


&НаСервере
Процедура Декорация1НажатиеНаСервере()
	Логин = Константы.Логин.Получить();
	СерверИсточник = "mysony";
	Адрес = "/backend/hs/v1/postlike/"+ Логин + "/" + ГУИД + "/1/0";
	
	HTTPЗапрос = Новый HTTPЗапрос(Адрес);
		
	HTTP = Новый HTTPСоединение(СерверИсточник);
	HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	ПолучитьИнициативу ();


КонецПроцедуры


&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	Декорация1НажатиеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПройтиОпрос(Команда)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ГУИД", ГУИД);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеЗакрытия", ЭтотОбъект); 

	ОткрытьФорму("ОбщаяФорма.ОпросВерсия1",ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЗакрытия (Результат, ДополнительныеПараметры) Экспорт
	
	ПолучитьИнициативу();
КонецПроцедуры


&НаКлиенте
Процедура Поделиться(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		Текст = "В мобильном приложении ФилИн, новая инициатива: " + Инициатива;
		Поделиться = Новый ЗапускПриложенияМобильногоУстройства();
		Поделиться.Действие = "android.intent.action.SEND";
		Поделиться.Тип = "text/plain";
		Поделиться.ИмяКласса = "com.whatsapp";
    	Поделиться.ДополнительныеДанные.Добавить("android.intent.extra.TEXT",Текст);
		Если Поделиться.ПоддерживаетсяЗапуск() Тогда
			Поделиться.Запустить(Истина);
		Иначе
			Сообщить("Не поддерживается");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

