
&НаКлиенте
Процедура СписокИнициатив(Команда)
	ОткрытьФорму("ОбщаяФорма.СписокИнициатив");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.ОтображатьКнопкуЗакрытия = Ложь;
	//Команды.Удалить("Закрыть");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ОтображатьКнопкуЗакрытия = Ложь;
	//Вставить содержимое обработчика
КонецПроцедуры
