
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Инициатива = Параметры.Инициатива;
	//Лайки = Параметры.Лайки;
	//Лизлайки = Параметры.Дизлайки;

	ГУИД = Параметры.ГУИД;
	ПолучитьДанные(ГУИД);


	
	
КонецПроцедуры

&НаКлиенте
Процедура ПройтиОпрос(Команда)
	ОткрытьФорму("ОбщаяФорма.Опрос");
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанные(ГУИД)
	
	Логин = Константы.Логин.Получить();
	СерверИсточник = "mysony";
	Адрес = "/backend/hs/v1/init/"+ Логин + "/" + ГУИД;
	
	
	//ПараметрыЗапроса = Новый Структура;
	//ПараметрыЗапроса.Вставить("fizik", Истина);
	//ПараметрыЗапроса = "?user=" + Строка(Пользователь.УникальныйИдентификатор());
	
	//Адрес = Адрес; //+ ПараметрыЗапроса;
	HTTPЗапрос = Новый HTTPЗапрос(Адрес);
		
	HTTP = Новый HTTPСоединение(СерверИсточник);
	HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Чтение		 =	Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаОтвета);
	Джисон = ПрочитатьJSON(Чтение,Истина);
	//Если ТипЗнч(Джисон) = Тип("Соответствие") Тогда
	//	Если Не Джисон["Ошибка"] = Неопределено Тогда
	//		Элементы.НетИнициатив.Видимость = Истина;
	//		Элементы.СписокИнициатив.Видимость = Ложь;
	//	КонецЕсли;		
	//Иначе
	//	//СписокИнициатив.Очистить();
	//	Для Каждого стр Из Джисон Цикл
	//		стрТЗ = СписокИнициатив.Добавить();
	//		стрТЗ.Инициатива = стр["Наименование"];
	//		стрТЗ.Лайки = стр["ОценкаЛайк"];
	//		стрТЗ.Дизлайки = стр["ОценкаДизлайк"];
	//		стрТЗ.СрокДо = стр["СрокДо"];
	//		стрТЗ.ГУИД = стр["ГУИД"];
	//	КонецЦикла;
	//	Элементы.НетИнициатив.Видимость = Ложь;
	//	Элементы.СписокИнициатив.Видимость = Истина;
	//КонецЕсли;

	
КонецПроцедуры
