
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ГУИД = Параметры.ГУИД;
	ПолучитьДанные(ГУИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ПройтиОпрос(Команда)
	ОткрытьФорму("ОбщаяФорма.Опрос");
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанные(ГУИД)
	
	Логин = Константы.Логин.Получить();
	СерверИсточник = "mysony";
	Адрес = "/backend/hs/v1/initiative/"+ Логин + "/" + ГУИД;
	
	
	//ПараметрыЗапроса = Новый Структура;
	//ПараметрыЗапроса.Вставить("fizik", Истина);
	//ПараметрыЗапроса = "?user=" + Строка(Пользователь.УникальныйИдентификатор());
	
	//Адрес = Адрес; //+ ПараметрыЗапроса;
	HTTPЗапрос = Новый HTTPЗапрос(Адрес);
		
	HTTP = Новый HTTPСоединение(СерверИсточник);
	HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Чтение		 =	Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаОтвета);
	ОтветJSON = ПрочитатьJSON(Чтение,Истина);

	Если ТипЗнч(ОтветJSON) = Тип("Соответствие") Тогда
		Инициатива = ОтветJSON["Наименование"];
		Лайки = ?(ОтветJSON["ОценкаЛайк"] = Неопределено, 0, Число(ОтветJSON["ОценкаЛайк"]));
		//Дизлайки = ?(ОтветJSON["ОценкаДизлайк"] = Неопределено, 0, Число(ОтветJSON["ОценкаДизлайк"]));
		СрокДо = ОтветJSON["СрокДо"];
		ГУИД = ОтветJSON["ГУИД"];
		Содержание = ОтветJSON["Содержание"];
		ОписаниеHTML = ОтветJSON["ОписаниеHTML"];
		ОпросПройден = ОтветJSON["ПользовательПрошелОпрос"];
		МассивФайлов = ОтветJSON["МассивФайлов"];
	КонецЕсли;
	
	Для Каждого Файл Из МассивФайлов Цикл
		стр = Файлы.Добавить();
		стр.ИмяФайла = Файл["ИмяФайла"];
		стр.Файл = Base64Значение(Файл["Файл"]);
	КонецЦикла;
	
	
	УстановитьHTMLвФорматированныйДокумент(ОписаниеHTML);
	
	Если Не ОпросПройден Тогда
		Элементы.ПройтиОпрос.Видимость = Истина;
	Иначе
		Элементы.ПройтиОпрос.Видимость = Ложь;
	КонецЕсли;
	
	 ЭтаФорма.Заголовок = Инициатива;
		

	
КонецПроцедуры

&НаСервере
Процедура ЛайкДизлайкОпроса(ПараметрОценки)
	
	
	Логин = Константы.Логин.Получить();
	СерверИсточник = "mysony";
	Адрес = "/backend/hs/v1/postlike/"+ Логин + "/"+ ГУИД + "/" + ПараметрОценки + "/0";
	
	HTTPЗапрос = Новый HTTPЗапрос(Адрес);
		
	HTTP = Новый HTTPСоединение(СерверИсточник);
	HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	ПолучитьДанные(ГУИД);

	
КонецПроцедуры

&НаКлиенте
Процедура ЛайкИконкаНажатие(Элемент)
	ЛайкДизлайкОпроса(1);
КонецПроцедуры


&НаСервере
Процедура УстановитьHTMLвФорматированныйДокумент(Знач пТекстHTML)
	лкВложения = Новый Структура;
	//лкПрефикс = "<img src='data:image/jpeg;base64, ";
	лкПрефикс = "< src='data:image/jpeg;base64, ";
	Пока Найти(пТекстHTML, лкПрефикс) > 0 Цикл
	
		лкНачалоКартинки = Найти(пТекстHTML, лкПрефикс) + СтрДлина(лкПрефикс);
		лкBase64ДанныеКартинки = Сред(пТекстHTML, лкНачалоКартинки);
		лкBase64ДанныеКартинки = Лев(лкBase64ДанныеКартинки, Найти(лкBase64ДанныеКартинки, "'") - 1);
		      //  лкBase64ДанныеКартинки = СтрЗаменить(лкBase64ДанныеКартинки,                                        " ","");
		
		лкКодСоответствия = "_" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
		лкКартинка = Новый Картинка(Base64Значение(лкBase64ДанныеКартинки));
		лкВложения.Вставить(лкКодСоответствия, лкКартинка);
		
		//пТекстHTML = СтрЗаменить(пТекстHTML, лкПрефикс + лкBase64ДанныеКартинки + "'",
		//	"<img src='" + лкКодСоответствия + "'");
		пТекстHTML = СтрЗаменить(пТекстHTML, лкПрефикс + лкBase64ДанныеКартинки + "'",
			"< src='" + лкКодСоответствия + "'");
	КонецЦикла;
	
	Сообщить(пТекстHTML);
	
	ФорматированныйДокумент.УстановитьHTML(пТекстHTML, лкВложения);


КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Файл = Новый Файл(Файлы[ВыбраннаяСтрока].ИмяФайла);
	ИмяФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);
	ДвоичныеДанные = Файлы[ВыбраннаяСтрока].Файл;
	ДвоичныеДанные.Записать(ИмяФайла);
	ЗапуститьПриложение(ИмяФайла);

КонецПроцедуры
