
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнениеТест();
	Если ФизЛицо Тогда
		Элементы.НазваниеОрганизации.Видимость = Ложь;
		Элементы.ИНН.Видимость = Ложь;
		Элементы.КПП.Видимость = Ложь;
	Иначе
		Элементы.НазваниеОрганизации.Видимость = Истина;
		Элементы.ИНН.Видимость = Истина;
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнениеТест ()
	Логин = Константы.Логин.Получить();
	ФизЛицо = Истина;
	//Рейтинг = "Диванный эксперт";
	//Пользователь = "Ivanov";
	//Никнэйм = "Иванов";
	//Телефон = "+79635554874";
	
	Логин = Константы.Логин.Получить();
	СерверИсточник = "mysony";
	Адрес = "/backend/hs/v1/rang/"+ Логин;
	
	HTTPЗапрос = Новый HTTPЗапрос(Адрес);
		
	HTTP = Новый HTTPСоединение(СерверИсточник);
	HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Чтение		 =	Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаОтвета);
	ОтветJSON = ПрочитатьJSON(Чтение,Истина);

	Если ТипЗнч(ОтветJSON) = Тип("Соответствие") Тогда
		Пользователь = ОтветJSON["Наименование"];
		Телефон = ОтветJSON["МобильныйТелефон"];
		Никнэйм = ОтветJSON["Логин"];
		ФизЛицо = ОтветJSON["ФизЛицо"];
		РейтингЗначение = ОтветJSON["Рейтинг"];
		Если РейтингЗначение < 5 Тогда
			Рейтинг = "Новичок";
		ИначеЕсли РейтингЗначение >= 5 И РейтингЗначение < 10 Тогда
			Рейтинг = "Среднячок";
		Иначе
			Рейтинг = "Диванный эксперт";
		КонецЕсли;
	КонецЕсли;


	
	
КонецПроцедуры