
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнениеТест();
	Если ФизЛицо Тогда
		Элементы.НазваниеОрганизации.Видимость = Ложь;
		Элементы.ИНН.Видимость = Ложь;
		Элементы.КПП.Видимость = Ложь;
	Иначе
		Элементы.НазваниеОрганизации.Видимость = Истина;
		Элементы.ИНН.Видимость = Истина;
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнениеТест ()
	ФизЛицо = Истина;
	Рейтинг = "Диванный эксперт";
	Пользователь = "Ivanov";
	Никнэйм = "Иванов";
	Телефон = "+79635554874";

	
	
КонецПроцедуры