Перем СтруктураЭлементыФормы Экспорт ;

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ПоляФормыПриИзменении(Элемент)
	
	//Если Элемент	
	
	
	

КонецПроцедуры // ПоляФормыПриИзменении()



&НаСервере
Функция  ПолучитьОпрос()
	
	Логин = Константы.Логин.Получить();
	СерверИсточник = "mysony";
	//Адрес = "/backend/hs/v1/opros/"+ Логин;
	
	Адрес = "backend/hs/v1/opros/" + Логин + "/" + ГУИД;
	
	HTTPЗапрос = Новый HTTPЗапрос(Адрес);
		
	HTTP = Новый HTTPСоединение(СерверИсточник);
	HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	//СтруктураЭлементыФормы = Новый Структура();
	
	МассивСтруктур = Новый Массив;
	
	Чтение		 =	Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаОтвета);
	Джисон = ПрочитатьJSON(Чтение,Истина);
	//Если ТипЗнч(Джисон) = Тип("Соответствие") Тогда
	//	
	//	//СписокИнициатив.Очистить();
	//	Для Каждого Соответствия Из Джисон["МассивВопросов"] Цикл
	//		
	//		//Для Каждого ЗначениеСоответствия из  Соответствия Цикл 
	//		//	СтруктураВопросов = Новый Структура;
	//		//	
	//		//	СтруктураВопросов.Вставить(ЗначениеСоответствия.Ключ,ЗначениеСоответствия.Значение);
	//		//	

	//		//	КонецЦикла;
	//		//
	//		МассивСтруктур.Добавить(Соответствия);
	//		
	//		
	//		//стрТЗ = СтруктураЭлементыФормы.Добавить();
	//	КонецЦикла;
	//	
	//	
	//Иначе
	//КонецЕсли;
				
 Возврат  Джисон;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	ГУИД = Параметры.ГУИД;
		
	СтруктураЭлементыФормы = ПолучитьОпрос();
	
	х = 0;
	Для Каждого СтруктураЭл Из СтруктураЭлементыФормы["МассивВопросов"]  Цикл 
		
		ТекстВопроса =  СтруктураЭл["Вопрос"];
		//КодВопроса =  СтруктураЭл["КодВопроса"];
		//
		//НовыеРеквизиты = Новый Массив;
		//НовыйРеквизитВопрос = Новый РеквизитФормы("Вопрос" + х, Новый ОписаниеТипов("Строка"), , "Вопрос" + х);
		//НовыйРеквизитКодВопроса = Новый РеквизитФормы("КодВопроса"+ х, Новый ОписаниеТипов("Строка"), , "КодВопроса"+ х);
		//НовыйРеквизитТипВопроса = Новый РеквизитФормы("ТипВопроса" + х, Новый ОписаниеТипов("Строка"), , "ТипВопроса" + х);
		//
		//ТаблицаЗначенийРеквизитов.Добавить("КодВопроса" + х);
		//
		//
		//НовыеРеквизиты.Добавить(НовыйРеквизитВопрос);
		//НовыеРеквизиты.Добавить(НовыйРеквизитКодВопроса);
		//НовыеРеквизиты.Добавить(НовыйРеквизитТипВопроса);
		//ЭтаФорма.ИзменитьРеквизиты(НовыеРеквизиты);
		//
		//НовыйЭлементВопрос = ЭтаФорма.Элементы.Вставить("Вопрос" + х, Тип("ПолеФормы"));
		//НовыйЭлементВопрос.ПутьКДанным = "Вопрос" + х;
		//НовыйЭлементВопрос.Вид = ВидПоляФормы.ПолеНадписи;
		//НовыйЭлементВопрос.Заголовок = ТекстВопроса; 
		
		//Ext
		НоваяГруппаВопрос = Элементы.Вставить("ГруппаВопрос" + х, Тип("ГруппаФормы"), Элементы.ГруппаВопросы);
		НоваяГруппаВопрос.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаВопрос.Заголовок = "";
		
		НовыйТекстВопроса = Элементы.Вставить("ТекстВопрос" + х, Тип("ДекорацияФормы"), НоваяГруппаВопрос);
		НовыйТекстВопроса.Вид = ВидДекорацииФормы.Надпись;
		НовыйТекстВопроса.Заголовок = ТекстВопроса;
		НоваяГруппаОтвет = Элементы.Вставить("ГруппаОтветы" + х, Тип("ГруппаФормы"),НоваяГруппаВопрос);
		НоваяГруппаОтвет.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппаОтвет.Заголовок = "";
		
		МассивОтветов = СтруктураЭл["МассивОтветов"];
		
		у = 0;
		
		Для Каждого ЭлМас Из МассивОтветов Цикл 
			МассивРеквизитовФормОтветы = Новый Массив;
			Если СтруктураЭл["ТипВопроса"] = "ОдинИзСписка" Тогда 
				
				НовыйРеквизитОтвет = Новый РеквизитФормы("Ответ" + х + "_" + у, Новый ОписаниеТипов("Булево"), , "Ответ" + у);
				МассивреквизитовФормОтветы.Добавить(НовыйРеквизитОтвет);
				ЭтаФорма.ИзменитьРеквизиты(МассивРЕквизитовФормОтветы);
				
				НовыйЭлементОтвет = ЭтаФорма.Элементы.Вставить("Ответ" + х + "_" + у, Тип("ПолеФормы"),НоваяГруппаОтвет);
				//НовыйЭлементОтвет.ПутьКДанным = "Ответ" + х + "_" + у;
				НовыйЭлементОтвет.ПутьКДанным = "Ответ" + х + "_" + у;

				НовыйЭлементОтвет.Вид = ВидПоляФормы.ПолеФлажка;
				//НовыйЭлементОтвет.ВидФлажка.Тумблер;
				//Тумблер
				НовыйЭлементОтвет.Заголовок = Строка(ЭлМас["Ответ"]); 
				НовыйЭлементОтвет.УстановитьДействие("ПриИзменении", "ЗначениеОтветаНаВопросПриИзменении"); 
				ТаблицаЗначенийРеквизитов.Добавить("Ответ" + у);
				
			ИначеЕсли СтруктураЭл["ТипВопроса"] = "НесколькоИзСписка" Тогда 
				
			ИначеЕсли СтруктураЭл["ТипВопроса"] = "ТекстСтрока" Тогда 
				НовыйРеквизитОтвет = Новый РеквизитФормы("Ответ" + х + "_" + у, Новый ОписаниеТипов("Строка"), , "Ответ" + у);
				МассивреквизитовФормОтветы.Добавить(НовыйРеквизитОтвет);
				ЭтаФорма.ИзменитьРеквизиты(МассивРЕквизитовФормОтветы);
				
				НовыйЭлементОтвет = ЭтаФорма.Элементы.Вставить("Ответ" + х + "_" + у, Тип("ПолеФормы"),НоваяГруппаОтвет);
				НовыйЭлементОтвет.ПутьКДанным = "Ответ" + х + "_" + у;
				НовыйЭлементОтвет.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлементОтвет.Заголовок =  Строка(ЭлМас["Ответ"]); 
				НовыйЭлементОтвет.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				НовыйЭлементОтвет.УстановитьДействие("ПриИзменении", "ЗначениеОтветаНаВопросПриИзменении"); 
				
			КонецЕсли;
			у = у+1;
		КонецЦикла;
		х=х+1;
	КонецЦикла;
	
	РеквизитХранилище = Новый ХранилищеЗначения(СтруктураЭлементыФормы);	

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОтветаНаВопросПриИзменении(Элемент)
	
	Если Элемент.Вид = ВидПоляФормы.ПолеФлажка Тогда 
		Если    ЭтаФорма.ЭтотОбъект[Элемент.Имя]  Тогда 
			Для Каждого Эл Из Элемент.Родитель.ПодчиненныеЭлементы Цикл 
				Если Эл.Имя = Элемент.Имя Тогда 
					Продолжить;
				КонецЕсли;
				ЭтаФорма.ЭтотОбъект[Эл.Имя] = Ложь; 
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьДанныеНаСервер();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтправитьДанныеНаСервер()
	
	ХХХ = РеквизитХранилище.Получить();
	Логин = Константы.Логин.Получить();
	СерверИсточник = "mysony";
	
	МаксимальныйНомерГруппыВопроса = ХХХ["МассивВопросов"].Количество();
	
	х = 0;	
	//ГУИД = "ea7ab650-e167-11e9-b200-b4b6860c0a9d";

	Пока х <= МаксимальныйНомерГруппыВопроса-1 Цикл 
		у=0;
		ВопросИзВходныхДанных = ХХХ["МассивВопросов"].Получить(х);
		Вопрос = ВопросИзВходныхДанных["КодВопроса"];
		МаксимальныйНомерГруппыОтвета = ВопросИзВходныхДанных["МассивОтветов"].Количество();
		
		Если ВопросИзВходныхДанных["ТипВопроса"] = "ТекстСтрока" Тогда 
			
			Пока у <= МаксимальныйНомерГруппыОтвета -1 Цикл
				
				Для Каждого Стрр Из ЭтаФорма.Элементы Цикл 
					Если Строка(Стрр.Имя) =  Строка("Ответ" + строка(Х) + "_"+ строка(у))  Тогда 
						ОтветНаВопрос =   ЭтаФорма.ЭтотОбъект[Стрр.Имя];
					КонецЕсли;
				КонецЦикла;
				у = у+1;   
			КонецЦикла;
			
		ИначеЕсли ВопросИзВходныхДанных["ТипВопроса"] = "ОдинИзСписка" Тогда 
			
			//Пока у <= МаксимальныйНомерГруппыОтвета -1 Цикл
				
				Для Каждого Стрр Из ЭтаФорма.Элементы Цикл 
					Если Строка(Стрр.Имя) =  Строка("Ответ" + строка(Х) + "_"+ строка(у))  Тогда 
						
						Для Каждого ПОдчЭл Из        Стрр.Родитель.ПодчиненныеЭлементы    Цикл 
							Если   ЭтаФорма.ЭтотОбъект[ПОдчЭл.Имя]  = Истина Тогда   
	
								Индекс = Число(Прав(Сред(ПОдчЭл.Имя, Найти(ПОдчЭл.Имя,"_")) , СтрДлина(Сред(ПОдчЭл.Имя, Найти(ПОдчЭл.Имя,"_"))) -1)) ;
								
							ОтветНаВопрос = ВопросИзВходныхДанных["МассивОтветов"][Индекс]["КодОтвета"];
							
							//ВопросИзВходныхДанных["МассивОтветов"].Получить(у)["КодОтвета"];
							КонецЕсли;
				

						КонецЦикла;
						
					//	Если   ЭтаФорма.ЭтотОбъект[Стрр.Имя] = Истина Тогда   
					//		ОтветНаВопрос = ВопросИзВходныхДанных["МассивОтветов"].Получить(у)["КодОтвета"];
					//	КонецЕсли;
					//	Прервать;
					//КонецЕсли;
					//Если ЗначениеЗаполнено(ОтветНаВопрос) Тогда 
					//	Прервать;
					КонецЕсли;
				КонецЦикла;
				//у = у+1;   
			//КонецЦикла;
			
			
		КонецЕсли;
		
		Адрес = "/backend/hs/v1/postopros/"+ Логин + "/"+ ГУИД + "/" + Вопрос + "/" + ОтветНаВопрос;

		HTTPЗапрос = Новый HTTPЗапрос(Адрес);
		
		HTTP = Новый HTTPСоединение(СерверИсточник);
		HTTPОтвет = HTTP.Получить(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		КонецЕсли;
		
			х =  х +1; 
	КонецЦикла;
	
	Возврат;	
	
КонецПроцедуры