Функция  СформироватьСписокИнициатив(ПараметрыПроверки)  Экспорт 

	
	Результат = Новый Структура("КодОтвета, Сообщение, СообщениеОбОшибке");
	ИмяФайлаВыгрузки = КаталогВременныхФайлов() + "\123.json";     
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Инициатива.Ссылка КАК Ссылка,
	               |	Инициатива.Наименование КАК Наименование,
	               |	Инициатива.Содержание КАК Содержание,
	               |	Инициатива.СрокДо КАК СрокДо,
	               |	Инициатива.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	               |	Инициатива.ДоступностьФизЛицам КАК ДоступностьФизЛицам
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Справочник.Инициатива КАК Инициатива
				   //|ГДЕ
				   //|	Инициатива.СрокДо >= &ТекущаяДата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(РейтингИнициатив.ОценкаЛайк, 0)) КАК ОценкаЛайк,
				   //|	СУММА(ЕСТЬNULL(РейтингИнициатив.ОценкаДизЛайк, 0)) КАК ОценкаДизЛайк,
	               |	РейтингИнициатив.Инициатива КАК Инициатива
	               |ПОМЕСТИТЬ ВТ_рейтинг
	               |ИЗ
	               |	РегистрСведений.РейтингИнициатив КАК РейтингИнициатив
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РейтингИнициатив.Инициатива
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Ссылка КАК Ссылка,
	               |	ВТ.Наименование КАК Наименование,
	               |	ВТ.Содержание КАК Содержание,
	               |	ВТ.СрокДо КАК СрокДо,
	               |	ВТ.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	               |	ВТ.ДоступностьФизЛицам КАК ДоступностьФизЛицам,
	               |	ЕСТЬNULL(ВТ_рейтинг.ОценкаЛайк, 0) КАК ОценкаЛайк 
				   //|	ЕСТЬNULL(ВТ_рейтинг.ОценкаДизЛайк, 0) КАК ОценкаДизЛайк
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_рейтинг КАК ВТ_рейтинг
	               |		ПО ВТ.Ссылка = ВТ_рейтинг.Инициатива";
				   //|ГДЕ
				   //|	(ВТ.ДоступностьФизЛицам = &ДоступностьФизЛицам
				   //|			ИЛИ ВТ.ДоступностьЮрЛицам = ВТ.ДоступностьФизЛицам)";	
	
	
	//Запрос.УстановитьПараметр("ДоступностьФизЛицам",Параметры.ФизЮрЛицо);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
 	
	
	
	РезЗапроса = Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда 
		
		
		
		Инициатива = Новый Структура;
		Инициатива.Вставить("Ошибка", "Не найдено инициатив");
		
		ЗаписьJSON = Новый ЗаписьJSON; 
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(); 
		ЗаписьJSON.ОткрытьФайл(ИмяФайлаВыгрузки, , , ПараметрыЗаписи) ; 
		ЗаписатьJSON(ЗаписьJSON, Инициатива); 
		ЗаписьJSON.Закрыть();
		
		ТекстДок = Новый ТекстовыйДокумент();
		ТекстДок.Прочитать(ИмяФайлаВыгрузки,КодировкаТекста.UTF8);
		
		
		Результат.Вставить("Сообщение", ТекстДок.ПолучитьТекст());
		
		Возврат Результат;
	КонецЕсли;
	
	
	Выборка = РезЗапроса.Выбрать();
	
	Массив = Новый Массив;
	х=0;
	
	//НастройкаСерилизацииJson = Новый НастройкиСериализацииJSON;
	//НастройкаСерилизацииJson.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	//НастройкаСерилизацииJson.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	Пока Выборка.Следующий() Цикл 
		Если ПараметрыПроверки.ФизЮрЛицо = "ФизЛицо" И  Выборка.ДоступностьФизЛицам Тогда 
			х= х+1;
			Инициатива = Новый Структура;
			Инициатива.Вставить("Наименование",Выборка.Наименование);
			Инициатива.Вставить("ОценкаЛайк",Выборка.ОценкаЛайк);
			//Инициатива.Вставить("ОценкаДизЛайк",Выборка.ОценкаДизЛайк);
			Инициатива.Вставить("ДоступностьЮрЛицам",Выборка.ДоступностьЮрЛицам);
			Инициатива.Вставить("ДоступностьФизЛицам",Выборка.ДоступностьФизЛицам);
			Инициатива.Вставить("ГУИД",Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			
			Инициатива.Вставить("СрокДо",Формат(Выборка.СрокДо,"ДФ=dd.MM.yyyy"));
			Результат.Вставить("КодОтвета", Истина);
			Результат.Вставить("СообщениеОбОшибке", "");
			
			Массив.Добавить(Инициатива);
			
		ИначеЕсли  ПараметрыПроверки.ФизЮрЛицо= "ЮрЛицо" И  Выборка.ДоступностьЮрЛицам Тогда 
			х= х+1;
			
			Инициатива = Новый Структура;
			Инициатива.Вставить("Наименование",Выборка.Наименование);
			Инициатива.Вставить("ОценкаЛайк",Выборка.ОценкаЛайк);
			//Инициатива.Вставить("ОценкаДизЛайк",Выборка.ОценкаДизЛайк);
			Инициатива.Вставить("ДоступностьЮрЛицам",Выборка.ДоступностьЮрЛицам);
			Инициатива.Вставить("ДоступностьФизЛицам",Выборка.ДоступностьФизЛицам);
			Инициатива.Вставить("ГУИД",Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			
			Инициатива.Вставить("СрокДо",Формат(Выборка.СрокДо,"ДФ=dd.MM.yyyy"));
			Результат.Вставить("КодОтвета", Истина);
			Результат.Вставить("СообщениеОбОшибке", "");
			
			Массив.Добавить(Инициатива);
			
		КонецЕсли;	
		
		
	КонецЦикла;
	
	Если х=0 Тогда  
		Инициатива = Новый Структура;
		Инициатива.Вставить("Ошибка", "Не найдено инициатив");
		
		ЗаписьJSON = Новый ЗаписьJSON; 
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(); 
		ЗаписьJSON.ОткрытьФайл(ИмяФайлаВыгрузки, , , ПараметрыЗаписи) ; 
		ЗаписатьJSON(ЗаписьJSON, Инициатива); 
		ЗаписьJSON.Закрыть();
		
		ТекстДок = Новый ТекстовыйДокумент();
		ТекстДок.Прочитать(ИмяФайлаВыгрузки,КодировкаТекста.UTF8);
		
		
		Результат.Вставить("Сообщение", ТекстДок.ПолучитьТекст());
		
		Возврат Результат;
		
		
	КонецЕсли;

	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(); 
	ЗаписьJSON.ОткрытьФайл(ИмяФайлаВыгрузки, , , ПараметрыЗаписи) ; 
	ЗаписатьJSON(ЗаписьJSON, Массив); 
	ЗаписьJSON.Закрыть();
	
	ТекстДок = Новый ТекстовыйДокумент();
	ТекстДок.Прочитать(ИмяФайлаВыгрузки,КодировкаТекста.UTF8);
	
	
	Результат.Вставить("Сообщение", ТекстДок.ПолучитьТекст());
	
	Возврат Результат;

	
	
КонецФункции

