
&НаКлиенте
Процедура СоздатьОпрос(Команда)
	
	
	Форма = ПолучитьФорму("Документ.Опрос.ФормаОбъекта");
	ДанныеФормы = Форма.Объект; // Получаем объект формы в переменную
	ЗаполнитьДокументНаСервере(ДанныеФормы); // Заполняем документ на сервере
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); // копируем наш объект в объект формы и далее открываем ее
	Форма.Открыть();
	
КонецПроцедуры


&НаСервере 
Функция ЗаполнитьДокументНаСервере(ДанныеФормы);
	
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.Опрос")); // Получаем объект из данных формы ИЛИ
	
	Док = Документы.Опрос.СоздатьДокумент();
	
	Док.Инициатива = Объект.Ссылка;
	Док.Дата = ТекущаяДата();
	
	ЗначениеВДанныеФормы(Док,ДанныеФормы); // Кладем обратно в объект формы уже созданный документ
	
КонецФункции

&НаКлиенте
Процедура ФорматированныйДокументСодержаниеПриИзменении(Элемент)
	лкТекстHTML	= "";
	лкВложения	= Новый Структура;
	
	ФорматированныйДокумент.ПолучитьHTML(лкТекстHTML, лкВложения);
	Для каждого лкВложение Из лкВложения Цикл
		//преобразуем объект "картинка" в строковое представление base64
		Стрим = Новый ПотокВПамяти;
		лкВложение.Значение.Записать(Стрим);
		Бинарник = Стрим.ЗакрытьИПолучитьДвоичныеДанные();
		ДанныеСтрокой = Base64Строка(Бинарник);
		//заменяем ссылку на файл картинки, картинкой в строковом представлении
		лкТекстHTML = СтрЗаменить(лкТекстHTML, "src=""" + лкВложение.Ключ + """", "src=""data:image/jpg;base64," + ДанныеСтрокой + """");
		
		//лкТекстHTML = СтрЗаменить(лкТекстHTML, "< src='" + лкВложение.Ключ + "'",
		//	"< src='data:image/jpeg;base64, " + Base64Строка(лкВложение.Значение.ПолучитьДвоичныеДанные()) + "'");
		//лкТекстHTML = СтрЗаменить(лкТекстHTML, "<img src='" + лкВложение.Ключ + "'",
		//	"<img src='data:image/jpeg;base64, " + Base64Строка(лкВложение.Значение.ПолучитьДвоичныеДанные()) + "'");
	КонецЦикла;
	
	Объект.ОписаниеHTML = лкТекстHTML;
	
	//Если Не ЗначениеЗаполнено(Объект.Содержание) Тогда 
	Объект.Содержание = ФорматированныйДокумент.ПолучитьТекст();
	Объект.Содержание = СтрЗаменить(Объект.Содержание,"¶", " "); 
	Объект.Содержание = СтрЗаменить(Объект.Содержание,Символы.ПС, " "); 
	Объект.Содержание = СтрЗаменить(Объект.Содержание,Символы.НПП, " "); 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 УстановитьHTMLвФорматированныйДокумент(Объект.ОписаниеHTML);
КонецПроцедуры

&НаСервере
Процедура УстановитьHTMLвФорматированныйДокумент(Знач пТекстHTML)
	

	лкВложения = Новый Структура;
	//лкПрефикс = "<img src='data:image/jpeg;base64, ";
	лкПрефикс = "< src='data:image/jpeg;base64, ";
	Пока Найти(пТекстHTML, лкПрефикс) > 0 Цикл
	
		лкНачалоКартинки = Найти(пТекстHTML, лкПрефикс) + СтрДлина(лкПрефикс);
		лкBase64ДанныеКартинки = Сред(пТекстHTML, лкНачалоКартинки);
		лкBase64ДанныеКартинки = Лев(лкBase64ДанныеКартинки, Найти(лкBase64ДанныеКартинки, "'") - 1);
		
		лкКодСоответствия = "_" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
		лкКартинка = Новый Картинка(Base64Значение(лкBase64ДанныеКартинки));
		лкВложения.Вставить(лкКодСоответствия, лкКартинка);
		
		//пТекстHTML = СтрЗаменить(пТекстHTML, лкПрефикс + лкBase64ДанныеКартинки + "'",
		//	"<img src='" + лкКодСоответствия + "'");
		пТекстHTML = СтрЗаменить(пТекстHTML, лкПрефикс + лкBase64ДанныеКартинки + "'",
			"< src='" + лкКодСоответствия + "'");
	КонецЦикла;
	
	ФорматированныйДокумент.УстановитьHTML(пТекстHTML, лкВложения);


КонецПроцедуры

