
&НаКлиенте
Процедура СоздатьОпрос(Команда)
	
	
	Форма = ПолучитьФорму("Документ.Опрос.ФормаОбъекта");
	ДанныеФормы = Форма.Объект; // Получаем объект формы в переменную
	ЗаполнитьДокументНаСервере(ДанныеФормы); // Заполняем документ на сервере
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); // копируем наш объект в объект формы и далее открываем ее
	Форма.Открыть();
	
КонецПроцедуры


&НаСервере 
Функция ЗаполнитьДокументНаСервере(ДанныеФормы);
	
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.Опрос")); // Получаем объект из данных формы ИЛИ
	
	Док = Документы.Опрос.СоздатьДокумент();
	
	Док.Инициатива = Объект.Ссылка;
	Док.Дата = ТекущаяДата();
	
	ЗначениеВДанныеФормы(Док,ДанныеФормы); // Кладем обратно в объект формы уже созданный документ
	
КонецФункции