
Функция ВыгрузитьСписокИнициативВыгрузитьСписокИнициатив(Запрос)
	
	ФизЮрЛицо = Строка(Запрос.ПараметрыURL.Получить("fizik"));

	
	ПараметрыПроверки = Новый Структура;
	ПараметрыПроверки.Вставить("ФизЮрЛицо", ФизЮрЛицо);
	
	Обработка = Обработки.ВыгрузитьСписокИнициатив.Создать();
	Результат = Обработка.СформироватьСписокИнициатив(ПараметрыПроверки);	

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	//Ответ.УстановитьТелоИзСтроки("<Response><Code>-1</Code><Message>Неизвестный запрос</Message></Response>");
	Ответ.УстановитьТелоИзСтроки(Результат.Сообщение);
	
	Возврат Ответ;

КонецФункции
